Revit 2027 API
FormattedText.GetAllCapsStatus Method
 Returns whether All, None or a Mixed of characters in the entire text are in all caps.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FormatStatus GetAllCapsStatus()
Public Function GetAllCapsStatus As FormatStatus
public:
FormatStatus GetAllCapsStatus()
member GetAllCapsStatus : unit -> FormatStatus
Return Value
FormatStatus
 The format status of all caps on characters FormatStatus.
Remarks
 This function only returns All or None if the entire text contains one character.
See Also
Reference
FormattedText Class
GetAllCapsStatus Overload
Autodesk.Revit.DB Namespace